In [5]:
import sqlite3
import pandas as pd

In [2]:
url="../../exercises/Ex_Files_SQL_Code_Challenges/Exercise Files/Ch01/restaurant.db"

In [3]:
con=sqlite3.connect(url)

In [22]:
cursor = con.cursor()

cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('EventsLocations',), ('Events',), ('CustomersEvents',), ('CustomersDishes',), ('Customers',), ('sqlite_sequence',), ('Dishes',), ('OrdersDishes',), ('Reservations',), ('Orders',), ('response',)]

In [16]:
pd.read_sql_query("select * from Customers", con).head()

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,1,Maggi,Domney,mdomney0@wisdompets.com,53177 Fieldstone Pass,San Bernardino,CA,760-702-5469,1938-10-11,15
1,2,Javier,Dawks,jdawks1@red30design.com,25629 Brown Trail,Hartford,CT,860-906-1459,1953-11-21,13
2,3,Aleen,Fasey,afasey2@kinetecoinc.com,41967 Mockingbird Court,Boca Raton,FL,561-410-2222,1900-08-10,3
3,4,Taylor,Jenkins,tjenkins@rouxacademy.org,968 Bartillon Park,Fort Lauderdale,FL,954-294-7424,1961-05-02,8
4,5,Imogen,Kabsch,ikabsch@landonhotel.com,222 Hudson Point,Anderson,SC,864-326-7456,1919-08-27,17

In [17]:
pd.read_sql_query("SELECT lastname,firstname,email from customers order by lastname asc", con).head()

   LastName FirstName                       Email
0     Algar   Giraldo    galgar21@kinetecoinc.com
1  Alphonso   Gustave  galphonso28@wisdompets.com
2    Annett     Romeo        rannett1e@samoca.org
3   Aspinal     Herby   haspinals@red30design.com
4   Attwool     Emlyn    eattwoolt@hplussport.com

In [21]:
cursor.execute("CREATE TABLE response (customerID int not null, response int, foreign key (customerID) REFERENCES customers(CustomerID));")

In [24]:
pd.read_sql_query("select * from dishes",con).head()

,DishID,Name,Description,Price,Type
0,1,Parmesan Deviled Eggs,These delectable little bites are made with or...,8.0,Appetizer
1,2,Artichokes with Garlic Aioli,Our artichokes are brushed with an olive oil a...,9.0,Appetizer
2,3,French Onion Soup,Caramelized onions slow cooked in a savory bro...,7.0,Main
3,4,Mini Cheeseburgers,These mini cheeseburgers are served on a fresh...,8.0,Main
4,5,Panko Stuffed Mushrooms,Large mushroom caps are filled a savory cream ...,7.0,Appetizer

In [25]:
pd.read_sql_query("select * from dishes order by price asc",con).head()

,DishID,Name,Description,Price,Type
0,21,Pomegranate Iced Tea,"Our unique blend of pomegranate juice, black R...",4.0,Beverage
1,18,Apple Pie,Made with local granny smith apples to bring y...,5.0,Dessert
2,17,Chocolate Chip Brownie,A warm chocolate chip brownie served with choc...,6.0,Dessert
3,20,Tropical Blue Smoothie,This blueberry mint-based smoothie is refreshi...,6.0,Beverage
4,22,Cafe Latte,Our house blend of espresso and foamed milk. C...,6.0,Beverage

In [28]:
pd.read_sql_query("select * from dishes where type<>'Beverage'order by type",con)

,DishID,Name,Description,Price,Type
0,1,Parmesan Deviled Eggs,These delectable little bites are made with or...,8.00,Appetizer
1,2,Artichokes with Garlic Aioli,Our artichokes are brushed with an olive oil a...,9.00,Appetizer
2,5,Panko Stuffed Mushrooms,Large mushroom caps are filled a savory cream ...,7.00,Appetizer
3,13,Barbecued Tofu Skewers,"Our barbecued skewers include tofu, cherry tom...",9.99,Appetizer
4,15,Creme Brulee,Elegantly crafted creamy vanilla custard with ...,9.00,Dessert
5,16,Cheesecake,"Our New York Style Cheesecake is rich, smooth,...",9.00,Dessert
6,17,Chocolate Chip Brownie,A warm chocolate chip brownie served with choc...,6.00,Dessert
7,18,Apple Pie,Made with local granny smith apples to bring y...,5.00,Dessert
8,19,Mixed Berry Tart,"Raspberries, blueberries, and strawberries on ...",7.00,Dessert
9,3,French Onion Soup,Caramelized onions slow cooked in a savory bro...,7.00,Main
10,4,Mini Cheeseburgers,These mini cheeseburgers are served on a fresh...,8.00,Main
11,6,Garden Buffet,"Choose from our fresh local, organically grown...",9.99,Main
12,7,House Salad,Our house salad is made with romaine lettuce a...,7.00,Main
13,8,Chef's Salad,"The chef's salad has cucumber, tomatoes, red o...",9.00,Main
14,9,Quinoa Salmon Salad,"Our quinoa salad is served with quinoa, tomato...",9.99,Main
15,10,Classic Burger,Our classic burger is made with 100% pure angu...,9.99,Main
16,11,Tomato Bruschetta Tortellini,This classic cheese tortellini is cooked in a ...,9.99,Main
17,12,Handcrafted Pizza,Our thin crust pizzas are made fresh daily and...,9.99,Main
18,14,Fiesta Family Platter,This platter is perfect for sharing! Enjoy our...,9.99,Main

In [36]:
pd.read_sql_query("select * from customers",con)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,1,Maggi,Domney,mdomney0@wisdompets.com,53177 Fieldstone Pass,San Bernardino,CA,760-702-5469,1938-10-11,15
1,2,Javier,Dawks,jdawks1@red30design.com,25629 Brown Trail,Hartford,CT,860-906-1459,1953-11-21,13
2,3,Aleen,Fasey,afasey2@kinetecoinc.com,41967 Mockingbird Court,Boca Raton,FL,561-410-2222,1900-08-10,3
3,4,Taylor,Jenkins,tjenkins@rouxacademy.org,968 Bartillon Park,Fort Lauderdale,FL,954-294-7424,1961-05-02,8
4,5,Imogen,Kabsch,ikabsch@landonhotel.com,222 Hudson Point,Anderson,SC,864-326-7456,1919-08-27,17
...,...,...,...,...,...,...,...,...,...,...
96,97,Herb,McParland,hmcparland2o@rouxacademy.org,39 Algoma Park,Chicago,IL,630-950-3309,1916-12-25,14
97,98,Clem,Durdy,cdurdy2p@hplussport.com,594 Bonner Point,Des Moines,IA,515-680-5018,1988-03-10,16
98,99,Kala,Stevenson,kstevenson@landonhotel.com,95 Waywood Street,Huntington,WV,304-681-5208,1947-11-30,5
99,100,Blythe,Leggan,bleggan2r@rouxacademy.org,1622 Golf Course Hill,Montgomery,AL,334-770-7364,1996-06-11,5
100,101,Julia,Kauffmann,j@gmail,1550 Lava Dr,Milwaukie,OR,555-555-555,1976-04-02,10

In [35]:
con.execute('insert into customers values(101,"Julia","Kauffmann","j@gmail","1550 Lava Dr","Milwaukie","OR","555-555-555","1976-04-02","10")')

In [50]:
pd.read_sql_query("select * from customers where lastname='Tapley' and firstname='Asher'",con)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,92,Asher,Tapley,atapley2j@kinetecoinc.com,720 Saint Paul Plaza,Hialeah,FL,786-938-4977,1959-08-05,7

In [52]:
pd.read_sql_query('select * from response',con)

Empty DataFrame
Columns: [customerID, response]
Index: []

In [70]:
con.execute("insert into response values((select customerid from customers where lastname='Tapley' and firstname='Asher'),3)")

In [73]:
pd.read_sql_query('select * from response',con)

   customerID  response
0          92         4

In [72]:
con.execute('update response set response=4 where customerID=92')